KCX-Mapping-Convert/testdaten/EMCS-V20/UidsFromKids/EMCSGenericRefusalMessage.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true"><To>DE01.CSFALT.2144</To><From>DE01.CSFALT.2144</From><MessageID>EI20100519</MessageID><SentAt>2011-08-19 12:02:00 +0200</SentAt><Act>request</Act><Method>EMCS</Method><MessageVersion>2.0</MessageVersion><MessageType>EMCSDeclarationRejected</MessageType></Header></soap:Header><soap:Body><Submit xmlns="http://www.eurtradenet.com/schemas/uids/emcs/body/200911"><EMCS><EMCSDeclarationRejected><AadReferenceCode>AadReferenceCode</AadReferenceCode><SequenceNumber>SequenceNumber</SequenceNumber><LocalReferenceNumber>ReferenceNumber</LocalReferenceNumber><Error><Type>ErrorType1</Type><Pointer>ErrorLocation1</Pointer><Reason>ErrorReason1</Reason><OriginalValue>OriginalAttributeValue1</OriginalValue></Error><Error><Type>ErrorType2</Type><Pointer>ErrorLocation2</Pointer><Reason>ErrorReason2</Reason><OriginalValue>OriginalAttributeValue2</OriginalValue></Error></EMCSDeclarationRejected></EMCS></Submit></soap:Body></soap:Envelope>
